In [1]:
#importng library for performing operation 
import pandas as pd

In [2]:
#giving file path or file notation to html file
html_file = 'sample_data.html'

In [3]:
#reading the html file
df = pd.read_html(html_file)[0]

In [4]:
#show the created dataframe
df

   ID     Name  Age
0   1    Alice   24
1   2      Bob   30
2   3  Charlie   22

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      3 non-null      int64
 1   Name    3 non-null      object
 2   Age     3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes

In [29]:
df.describe()

        ID        Age
count  3.0   3.000000
mean   2.0  25.333333
std    1.0   4.163332
min    1.0  22.000000
25%    1.5  23.000000
50%    2.0  24.000000
75%    2.5  27.000000
max    3.0  30.000000

In [7]:
#givig file path or file notation to json file
json_file = 'sample_data.json'

In [11]:
#reading the html file
dt=pd.read_json(json_file)

In [13]:
dt

   id     name  age         city
0   1    Alice   24     New York
1   2      Bob   30  Los Angeles
2   3  Charlie   22      Chicago

In [31]:
dt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      3 non-null      int64
 1   name    3 non-null      object
 2   age     3 non-null      int64
 3   city    3 non-null      object
dtypes: int64(2), object(2)
memory usage: 228.0+ bytes

In [33]:
dt.describe()

        id        age
count  3.0   3.000000
mean   2.0  25.333333
std    1.0   4.163332
min    1.0  22.000000
25%    1.5  23.000000
50%    2.0  24.000000
75%    2.5  27.000000
max    3.0  30.000000

In [15]:
#giving file path or file notation to xml file
xml_file = 'sample_data.xml'

In [17]:
dp=pd.read_xml(xml_file)

In [19]:
#show the created dataframe
dp

   id     name  age      address
0   1    Alice   24     New York
1   2      Bob   30  Los Angeles
2   3  Charlie   22      Chicago

In [35]:
dp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       3 non-null      int64
 1   name     3 non-null      object
 2   age      3 non-null      int64
 3   address  3 non-null      object
dtypes: int64(2), object(2)
memory usage: 228.0+ bytes

In [37]:
dp.describe()

        id        age
count  3.0   3.000000
mean   2.0  25.333333
std    1.0   4.163332
min    1.0  22.000000
25%    1.5  23.000000
50%    2.0  24.000000
75%    2.5  27.000000
max    3.0  30.000000

In [21]:
excel_File= 'sample_data.xlsx'

In [23]:
#giving file path or file notation to excel file
de=pd.read_excel(excel_File)

In [24]:
#show the created dataframe
de

   0 First Name  Last Name  Gender        Country  Age        Date    Id
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida    Magwood  Female  United States   58  16/08/2016  2468
5  6     Gaston      Brumm    Male  United States   24  21/05/2015  2554
6  7       Etta       Hurn  Female  Great Britain   56  15/10/2017  3598
7  8    Earlean     Melgar  Female  United States   27  16/08/2016  2456
8  9   Vincenza    Weiland  Female  United States   40  21/05/2015  6548

In [39]:
de.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   0           9 non-null      int64
 1   First Name  9 non-null      object
 2   Last Name   9 non-null      object
 3   Gender      9 non-null      object
 4   Country     9 non-null      object
 5   Age         9 non-null      int64
 6   Date        9 non-null      object
 7   Id          9 non-null      int64
dtypes: int64(3), object(5)
memory usage: 708.0+ bytes

In [41]:
de.describe()

              0        Age           Id
count  9.000000   9.000000     9.000000
mean   5.000000  35.888889  2989.333333
std    2.738613  13.147666  1511.344517
min    1.000000  24.000000  1562.000000
25%    3.000000  25.000000  2456.000000
50%    5.000000  32.000000  2554.000000
75%    7.000000  40.000000  3549.000000
max    9.000000  58.000000  6548.000000